
def selection_sort(lst):
    n = len(lst)
    for i in range(0, n-1):
        index = i
        for j in range(i+1, n):
            if (lst[j] < lst[index]):
                index = j
        lst[index], lst[i] = lst[i], lst[index]
        if __name__ == '__main__':
            print(i, lst)
    return lst
        

if __name__ == '__main__':
    i = input("ソートしたい値をスペース区切りで入力：")
    print(selection_sort(i.split()))

'''
実行結果
ソートしたい値をスペース区切りで入力：3 7 2 8 1 9 4 5 5
0 ['1', '7', '2', '8', '3', '9', '4', '5', '5']
1 ['1', '2', '7', '8', '3', '9', '4', '5', '5']
2 ['1', '2', '3', '8', '7', '9', '4', '5', '5']
3 ['1', '2', '3', '4', '7', '9', '8', '5', '5']
4 ['1', '2', '3', '4', '5', '9', '8', '7', '5']
5 ['1', '2', '3', '4', '5', '5', '8', '7', '9']
6 ['1', '2', '3', '4', '5', '5', '7', '8', '9']
7 ['1', '2', '3', '4', '5', '5', '7', '8', '9']
['1', '2', '3', '4', '5', '5', '7', '8', '9']
'''